---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FaceSplitterFailures.NoFaceForSplit
source: html/923a8482-ba81-100c-261c-96802a202ee2.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FaceSplitterFailures.NoFaceForSplit Property

The highlighted element no longer contains a face that has been split by highlighted sketch.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoFaceForSplit { get; }
```